{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6", "config": [{"class_name": "Conv2D", "config": {"filters": 32, "data_format": "channels_last", "name": "conv2d_5", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_constraint": null, "dtype": "float32", "padding": "valid", "batch_input_shape": [null, 48, 48, 1], "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_5", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 64, "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_6", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_6", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 128, "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_7", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_7", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 128, "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_8", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_8", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_3", "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_4", "activity_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 7, "bias_regularizer": null}}]}