{"format": "layers-model", "generatedBy": "keras v2.1.6", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"config": [{"config": {"batch_input_shape": [null, 50, 3], "padding": "valid", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv1d_1", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_size": [7], "strides": [1], "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1], "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "units": 1, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "activation": "sigmoid"}, "class_name": "Dense"}], "class_name": "Sequential"}, "training_config": {"optimizer_config": {"config": {"epsilon": 1e-07, "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421, "decay": 0.0, "amsgrad": false, "lr": 0.0010000000474974513}, "class_name": "Adam"}, "metrics": ["accuracy"], "loss_weights": null, "sample_weight_mode": null, "loss": "binary_crossentropy"}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv1d_1/kernel", "shape": [7, 3, 32], "dtype": "float32"}, {"name": "conv1d_1/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [1408, 1], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [1], "dtype": "float32"}]}]}